Let's start by important the appropriate libraries.

In [77]:
import pandas as pd

In [78]:
import numpy as np

<font color='red'>To-do:</font> Insert a cell in markdown mode and write "This is a markdown example" in italics.

*This is a markdown example*

### Initialization
You can create a Series by passing a list of values. By default, pandas will create an integer index.

In [79]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

Let's create another Series

In [80]:
s2 = pd.Series(["1", "10", "3", "44"])

In [81]:
import random
s3 = pd.Series([random.randint(0,5) for i in range(10)])

<font color='red'>To-do:</font> Insert a new cell above this one and create a new series, s3, with 10 random numbers between 0 and 5

<font color='red'>To-do:</font> If you aim to store integers, string is an inefficient data type. Let's convert this series to the appropriate data type and store the result in s4. Display s4.

In [82]:
s4 = s2.astype(int)
s4

0     1
1    10
2     3
3    44
dtype: int32

You can also use pandas to create an series of datetime objects. Let’s make one for the week beginning January 25th, 2015:

In [83]:
dates = pd.date_range('20150125',periods=7)
dates

DatetimeIndex(['2015-01-25', '2015-01-26', '2015-01-27', '2015-01-28',
               '2015-01-29', '2015-01-30', '2015-01-31'],
              dtype='datetime64[ns]', freq='D')

<font color='red'>To-do:</font> The date-range functionality can do more! Insert a new cell below this one and create a new dates2 DatetimeIndex object that starts at 4PM on September 1, 2021, that repeats weekly 15 times . Display the result.

In [84]:
import datetime
start_date = datetime.datetime(2021, 9, 1, 16, 0)
dates2 = pd.date_range(start_date, periods = 15, freq = "W")
dates2

DatetimeIndex(['2021-09-05 16:00:00', '2021-09-12 16:00:00',
               '2021-09-19 16:00:00', '2021-09-26 16:00:00',
               '2021-10-03 16:00:00', '2021-10-10 16:00:00',
               '2021-10-17 16:00:00', '2021-10-24 16:00:00',
               '2021-10-31 16:00:00', '2021-11-07 16:00:00',
               '2021-11-14 16:00:00', '2021-11-21 16:00:00',
               '2021-11-28 16:00:00', '2021-12-05 16:00:00',
               '2021-12-12 16:00:00'],
              dtype='datetime64[ns]', freq='W-SUN')

Now we’ll create a DataFrame using the dates array as our index, fill it with some random values using numpy, and give the columns some labels.

In [85]:
df = pd.DataFrame(np.random.randn(7,4), index=dates, columns=['col1','col2','col4','col3'])
df

                col1      col2      col4      col3
2015-01-25  0.132419  1.112387 -1.351644  0.622150
2015-01-26  0.551210 -0.721437 -0.821639 -1.040171
2015-01-27 -3.066199 -1.494748 -0.171880  0.455236
2015-01-28 -0.931278  0.992433  0.477195  0.868746
2015-01-29  0.007473 -1.428318 -0.654668  0.389609
2015-01-30  0.239541  1.071332  0.693687  0.395706
2015-01-31 -1.940643 -1.365024 -0.056047 -2.457060

<font color='red'>To-do:</font> Now create df2 that uses dates2 as its index. Use the same set of columns ('col1','col2','col4','col3').

In [86]:
df2 = pd.DataFrame(np.random.randn(15,4), index=dates2, columns=['col1','col2','col4','col3'])
df2

                         col1      col2      col4      col3
2021-09-05 16:00:00  1.562635 -0.710652  0.575682 -0.031795
2021-09-12 16:00:00 -1.448286 -0.039087  0.001811  0.099392
2021-09-19 16:00:00  0.180702  0.693268  0.356155 -1.094452
2021-09-26 16:00:00 -2.157729 -0.758493 -2.009010  0.781928
2021-10-03 16:00:00  0.437708 -0.443544 -0.660354  1.104733
2021-10-10 16:00:00 -1.425657  0.501557 -0.005280  0.554903
2021-10-17 16:00:00  0.791421 -0.653847 -0.559359  2.318529
2021-10-24 16:00:00 -0.453007 -1.690149 -0.385619  0.199696
2021-10-31 16:00:00  0.500273  0.285085 -0.315206 -1.724247
2021-11-07 16:00:00 -0.025939 -0.939415  0.691047  0.866765
2021-11-14 16:00:00 -0.456320  0.090135  1.184989 -1.209700
2021-11-21 16:00:00 -1.023213 -2.436086  0.798384 -0.088224
2021-11-28 16:00:00  1.023786  0.615030 -0.411781  0.147136
2021-12-05 16:00:00 -0.290809 -1.066685  0.779950  0.881381
2021-12-12 16:00:00  0.219873 -0.147370  1.028911 -1.086468

It can also be useful to know how to create a DataFrame from a dict of objects. This comes in particularly handy when working with JSON-like structures.

In [54]:
df3 = pd.DataFrame({ 'A' : 1.,
                            'B' : pd.Timestamp('20130102'),
                            'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                            'D' : np.array([3] * 4,dtype='int32'),
                            'E' : pd.Categorical(["test","train","test","train"]),
                            'F' : 'foo' })
df3

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

<font color='red'>To-do:</font> Below we are trying to create another DataFrame df4. But there are some mistakes. Correct these mistakes to make sure the code compiles. Do not edit column c2.

???

In [98]:
!python3 --version

Python 3.9.7

In [100]:
df4 = pd.DataFrame({"c1":[ ],
                    "c2": [1.2, 0.5, "tree"],
                    "c3": {True, False, True}
                   })

ValueError: arrays must all be same length

In [94]:
dftest = pd.DataFrame({"c2": {1.2, 0.5, 3.1, "tree"}})

TypeError: Set type is unordered

In [93]:
type({1.2, 0.5, 3.1, "tree"})

set

### Exploring data in a DataFrame
We can access the index of a dataframe as follows:

In [67]:
df.index

DatetimeIndex(['2015-01-25', '2015-01-26', '2015-01-27', '2015-01-28',
               '2015-01-29', '2015-01-30', '2015-01-31'],
              dtype='datetime64[ns]', freq='D')

<font color='red'>To-do:</font> Print out the datatypes of columns in df4.

In [69]:
df4.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

What do you see for c2? You can see that pandas tries to find a common object type. This is great but this flexibility can also result in runtime errors.  Make sure you are careful with the use of data types.

A few other basic operations:

In [ ]:
df.values

array([[-1.56525751,  0.47884924,  0.43971897,  0.24117685],
       [-1.15701686,  1.20866065, -0.44485132, -0.08569942],
       [-0.95318202,  0.69626462,  2.05079672,  0.72093192],
       [ 1.34843118, -0.47707926, -0.62030739,  0.37340474],
       [-0.98605809, -0.82101997,  0.06792945,  0.72206496],
       [-0.77213966, -0.11765859, -2.20098501, -0.72340018],
       [ 0.95935785,  0.70179348, -1.60533725, -0.61658203]])

In [ ]:
df.describe()

           col1      col2      col4      col3
count  7.000000  7.000000  7.000000  7.000000
mean   0.032236 -0.199913  1.039976  0.010316
std    0.534280  0.757777  0.939818  0.769947
min   -0.658019 -1.009633 -0.014763 -1.336276
25%   -0.392661 -0.822406  0.438829 -0.276459
50%    0.076587 -0.007301  0.864404  0.037950
75%    0.514638  0.060768  1.443175  0.424561
max    0.563130  1.140814  2.666186  1.074339

<font color='red'>To-do:</font> Print the column names for df.

In [87]:
df.columns

Index(['col1', 'col2', 'col4', 'col3'], dtype='object')

<font color='red'>To-do:</font> Change the column names of df2 to A,B,C and D in order.

In [88]:
df2.columns = ["A", "B", "C", "D"]
df2

                            A         B         C         D
2021-09-05 16:00:00  1.562635 -0.710652  0.575682 -0.031795
2021-09-12 16:00:00 -1.448286 -0.039087  0.001811  0.099392
2021-09-19 16:00:00  0.180702  0.693268  0.356155 -1.094452
2021-09-26 16:00:00 -2.157729 -0.758493 -2.009010  0.781928
2021-10-03 16:00:00  0.437708 -0.443544 -0.660354  1.104733
2021-10-10 16:00:00 -1.425657  0.501557 -0.005280  0.554903
2021-10-17 16:00:00  0.791421 -0.653847 -0.559359  2.318529
2021-10-24 16:00:00 -0.453007 -1.690149 -0.385619  0.199696
2021-10-31 16:00:00  0.500273  0.285085 -0.315206 -1.724247
2021-11-07 16:00:00 -0.025939 -0.939415  0.691047  0.866765
2021-11-14 16:00:00 -0.456320  0.090135  1.184989 -1.209700
2021-11-21 16:00:00 -1.023213 -2.436086  0.798384 -0.088224
2021-11-28 16:00:00  1.023786  0.615030 -0.411781  0.147136
2021-12-05 16:00:00 -0.290809 -1.066685  0.779950  0.881381
2021-12-12 16:00:00  0.219873 -0.147370  1.028911 -1.086468

### Some basic data transformations
DataFrames have a built-in transpose

In [89]:
df.T

,2015-01-25,2015-01-26,2015-01-27,2015-01-28,2015-01-29,2015-01-30,2015-01-31
col1,0.132419,0.551210,-3.066199,-0.931278,0.007473,0.239541,-1.940643
col2,1.112387,-0.721437,-1.494748,0.992433,-1.428318,1.071332,-1.365024
col4,-1.351644,-0.821639,-0.171880,0.477195,-0.654668,0.693687,-0.056047
col3,0.622150,-1.040171,0.455236,0.868746,0.389609,0.395706,-2.457060

We can also sort a DataFrame along a given data dimension. For example, we might want to sort by the values in the second column:

In [90]:
df.sort_values(by=['col2'])

                col1      col2      col4      col3
2015-01-27 -3.066199 -1.494748 -0.171880  0.455236
2015-01-29  0.007473 -1.428318 -0.654668  0.389609
2015-01-31 -1.940643 -1.365024 -0.056047 -2.457060
2015-01-26  0.551210 -0.721437 -0.821639 -1.040171
2015-01-28 -0.931278  0.992433  0.477195  0.868746
2015-01-30  0.239541  1.071332  0.693687  0.395706
2015-01-25  0.132419  1.112387 -1.351644  0.622150

We can also sort the rows (axis = 0) by their index values:

In [91]:
df.sort_index(axis=0, ascending=False)

                col1      col2      col4      col3
2015-01-31 -1.940643 -1.365024 -0.056047 -2.457060
2015-01-30  0.239541  1.071332  0.693687  0.395706
2015-01-29  0.007473 -1.428318 -0.654668  0.389609
2015-01-28 -0.931278  0.992433  0.477195  0.868746
2015-01-27 -3.066199 -1.494748 -0.171880  0.455236
2015-01-26  0.551210 -0.721437 -0.821639 -1.040171
2015-01-25  0.132419  1.112387 -1.351644  0.622150

<font color='red'>To-do:</font> Sort df according to column header values using df.sort_index.

In [92]:
df.sort_index()

                col1      col2      col4      col3
2015-01-25  0.132419  1.112387 -1.351644  0.622150
2015-01-26  0.551210 -0.721437 -0.821639 -1.040171
2015-01-27 -3.066199 -1.494748 -0.171880  0.455236
2015-01-28 -0.931278  0.992433  0.477195  0.868746
2015-01-29  0.007473 -1.428318 -0.654668  0.389609
2015-01-30  0.239541  1.071332  0.693687  0.395706
2015-01-31 -1.940643 -1.365024 -0.056047 -2.457060

### Selection
To select only only the first few rows of a DataFrame, use the .head() function, or tail to get the last few rows. These functions by default return 5 rows but you can change that.

In [ ]:
df.head()

                col1      col2      col4      col3
2015-01-25  1.169508 -0.212093  1.473943 -0.041706
2015-01-26 -1.125070  1.489873 -0.291176  0.212922
2015-01-27 -0.360527 -0.993890 -0.515548 -0.732518
2015-01-28  0.636781  1.122845  0.250235  0.260566
2015-01-29 -0.541771  0.028655 -0.418725  0.439577

<font color='red'>To-do:</font> Get the last 3 rows in df.

Selecting a single column yields a Series, equivalent to df.col1:

In [ ]:
df['col1']

2015-01-25    0.428971
2015-01-26    0.533958
2015-01-27    0.029070
2015-01-28    0.394074
2015-01-29   -0.783707
2015-01-30    1.818847
2015-01-31   -0.212324
Freq: D, Name: col1, dtype: float64

We can also select a subset of the rows using slicing. You can select either by integer indexing or by value:

In [ ]:
df[1:3]

                col1      col2      col4      col3
2015-01-26  0.533958 -1.771079  0.406799  0.464749
2015-01-27  0.029070  2.788811  0.039847  1.017054

In [ ]:
df['20150127':'20150130']

                col1      col2      col4      col3
2015-01-27  0.029070  2.788811  0.039847  1.017054
2015-01-28  0.394074 -0.256263 -1.237009  1.437256
2015-01-29 -0.783707  1.624465  0.175387  0.900945
2015-01-30  1.818847 -0.357406  0.472610 -0.759130

To select more than one column at a time, try .loc[]):

In [ ]:
df.loc[:,['col2','col4']]

                col2      col4
2015-01-25 -2.716061  0.169851
2015-01-26 -1.771079  0.406799
2015-01-27  2.788811  0.039847
2015-01-28 -0.256263 -1.237009
2015-01-29  1.624465  0.175387
2015-01-30 -0.357406  0.472610
2015-01-31 -0.690658  0.448218

You can select on rows and columns at the same time:

<font color='red'>To-do:</font> You can select on rows and columns at the same time. Select rows from '20150127' through '20150130' and columns col3 and col1.

You can also use boolean indexing to select subset of a dataframe that satisfies a requirement

In [ ]:
df[df['col1'] > 1]

                col1      col2      col4      col3
2015-01-28  1.094025 -0.432489  0.226241 -0.647203
2015-01-29  1.495063 -0.060964  0.733351 -0.044121

<font color='red'>To-do:</font> Now select the rows where  col1  is greater than 0 or col4 is greater than -0.5.

In [377]:
nonneg_only = df[df > 0]

In [378]:
nonneg_only

                col1      col2      col4      col3
2015-01-25       NaN       NaN  0.101221  0.299595
2015-01-26  0.440326  1.579973  0.741130  0.644201
2015-01-27       NaN       NaN  0.328215  0.780538
2015-01-28  0.964300       NaN  0.211903       NaN
2015-01-29  0.292702  0.927658       NaN       NaN
2015-01-30       NaN       NaN       NaN       NaN
2015-01-31  1.637575       NaN       NaN       NaN

You can drop rows with missing values as such:

In [379]:
nonneg_only.dropna()

                col1      col2     col4      col3
2015-01-26  0.440326  1.579973  0.74113  0.644201

There were no rows with no missing values (most likely, these are random numbers after all...) and therefore the result is an empty dataframe. You can instead assign a default value (here, 0) to the NaN values

In [380]:
nonneg_only.fillna(value=0)

                col1      col2      col4      col3
2015-01-25  0.000000  0.000000  0.101221  0.299595
2015-01-26  0.440326  1.579973  0.741130  0.644201
2015-01-27  0.000000  0.000000  0.328215  0.780538
2015-01-28  0.964300  0.000000  0.211903  0.000000
2015-01-29  0.292702  0.927658  0.000000  0.000000
2015-01-30  0.000000  0.000000  0.000000  0.000000
2015-01-31  1.637575  0.000000  0.000000  0.000000

You can also do filtering using non-numeric values:

In [167]:
df_c = df.copy()
df_c['color'] = ['red', 'blue', 'red', 'red', 'blue', 'green', 'green' ]
df_c

                col1      col2      col4      col3  color
2015-01-25  0.876023 -0.979346  0.177589  0.550717    red
2015-01-26  0.162915 -0.804229 -2.395167  1.107120   blue
2015-01-27 -0.942640  1.812220 -0.498577 -1.932426    red
2015-01-28  0.605609  2.917070  0.863059 -0.361865    red
2015-01-29  0.838000  1.114411 -0.538151 -1.944446   blue
2015-01-30  0.239596  0.075887  1.018430  0.620328  green
2015-01-31 -0.265844  0.328391 -0.361832  1.380344  green

In [168]:
df_c[df_c['color'].isin(['red','blue'])]

                col1      col2      col4      col3 color
2015-01-25  0.876023 -0.979346  0.177589  0.550717   red
2015-01-26  0.162915 -0.804229 -2.395167  1.107120  blue
2015-01-27 -0.942640  1.812220 -0.498577 -1.932426   red
2015-01-28  0.605609  2.917070  0.863059 -0.361865   red
2015-01-29  0.838000  1.114411 -0.538151 -1.944446  blue

<font color='red'>To-do:</font> Now filter and display rows where color is not blue or red.

### Combining DataFrames
You can combine DataFrame objects using simple concatenation (provided they have the same columns):

In [169]:
frame_one = pd.DataFrame(np.random.randn(5, 4))
frame_one

          0         1         2         3
0  0.298328  0.356276  0.639760 -0.982459
1 -1.581586 -0.241907 -0.481574 -0.431748
2  0.585660  0.700722 -0.892308 -0.098240
3  0.527334 -0.167359  0.583877  0.398375
4 -0.898240 -0.145914 -0.911307  1.500939

In [170]:
frame_two = pd.DataFrame(np.random.randn(5, 4))
frame_two

          0         1         2         3
0  0.212458 -0.848519 -0.527881  1.502029
1  0.393064  0.722910 -1.360868  0.586074
2  0.610651 -0.228178  0.720182 -0.775996
3 -0.194432  0.309427  0.346161 -0.462890
4  1.389668  0.035374 -1.307717  0.054265

In [171]:
pd.concat([frame_one, frame_two])

          0         1         2         3
0  0.298328  0.356276  0.639760 -0.982459
1 -1.581586 -0.241907 -0.481574 -0.431748
2  0.585660  0.700722 -0.892308 -0.098240
3  0.527334 -0.167359  0.583877  0.398375
4 -0.898240 -0.145914 -0.911307  1.500939
0  0.212458 -0.848519 -0.527881  1.502029
1  0.393064  0.722910 -1.360868  0.586074
2  0.610651 -0.228178  0.720182 -0.775996
3 -0.194432  0.309427  0.346161 -0.462890
4  1.389668  0.035374 -1.307717  0.054265

<font color='red'>To-do:</font> Now concatenate along the other axis.

<font color='red'>To-do:</font> Do you see an issue here? What do you think we need to do to avoid this problem?

You can also perform SQL-like merge operations

In [172]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
left

   key  lval
0  foo     1
1  bar     2

In [173]:
right = pd.DataFrame({'key': ['foo', 'foo', 'bar'], 'rval': [3, 4, 5]}) 
right

   key  rval
0  foo     3
1  foo     4
2  bar     5

In [174]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     3
1  foo     1     4
2  bar     2     5

<font color='red'>To-do:</font> Now create two new dataframes, X and Y, with two matching columns, key1 and key2, anyway you prefer and merge them by matching on them

<font color='red'>To-do:</font> Notice that when you merge, if you had any rows on X and Y that didn't have a match, these are lost by default. Now merge X and Y to keep all rows (including the non-matching ones) of X in the result

### Grouping
Sometimes you will want to group and summarize a DataFrame for a more efficient computation. This is one of the strengths of pandas and DataFrames.

In [175]:
foo_bar = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar','foo', 'bar', 'foo', 'foo'],
                                   'B' : ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
                                   'C' : np.random.randn(8),
                                   'D' : np.random.randn(8)})
foo_bar

     A      B         C         D
0  foo    one  0.084911  2.195546
1  bar    one  0.685135  0.973480
2  foo    two  0.033826  0.026805
3  bar  three  0.678738  1.218613
4  foo    two -0.222444 -0.118383
5  bar    two -0.431803  0.094794
6  foo    one -0.311094 -0.118205
7  foo  three -0.936183  0.186101

In [176]:
grouped = foo_bar.groupby('A').sum()
grouped

            C         D
A
bar  0.932070  2.286887
foo -1.350984  2.171863

<font color='red'>To-do:</font> What happened to column B? Because sum oepration cannot be applied to datatype string, the column was dropped here. Now use both columns to perform the operation for each possible A, B pair. Assign this to "grouped" and display it.

The .stack() function can be used to compress a level in the DataFrame’s columns:

In [177]:
stacked = grouped.stack()
stacked

A
bar  C    0.932070
     D    2.286887
foo  C   -1.350984
     D    2.171863
dtype: float64

In [178]:
stacked.unstack()

            C         D
A
bar  0.932070  2.286887
foo -1.350984  2.171863

## Reading from/Writing to files
You can write a dataframe to file as follows:

In [179]:
grouped.to_csv('grouped.csv')

<font color='red'>To-do:</font> Now write this same DataFrame to a JSON file.

And you can read as follows:

In [180]:
new_frame = pd.read_csv('grouped.csv')

<font color='red'>To-do:</font> Now read the dataframe back but with columns renamed as X, Y and Z

In [181]:
new_frame.head()

     A         C         D
0  bar  0.932070  2.286887
1  foo -1.350984  2.171863

Let's now work with a relatively more complex and bigger file

In [182]:
comics_df = pd.read_csv('comic_characters.csv')
comics_df

,id,publisher,name,Identity,align,eye,hair,sex,alive,appearances,first_appearance,month,year,date
0,1,Marvel,Spider-Man (Peter Parker),Secret Identity,Good Characters,Hazel Eyes,Brown Hair,Male Characters,Living Characters,4043.0,"1962, August",August,1962.0,8/1/1962
1,2,Marvel,Captain America (Steven Rogers),Public Identity,Good Characters,Blue Eyes,White Hair,Male Characters,Living Characters,3360.0,"1941, March",March,1941.0,3/1/1941
2,3,Marvel,"Wolverine (James \""Logan\"" Howlett)",Public Identity,Neutral Characters,Blue Eyes,Black Hair,Male Characters,Living Characters,3061.0,"1974, October",October,1974.0,10/1/1974
3,4,Marvel,"Iron Man (Anthony \""Tony\"" Stark)",Public Identity,Good Characters,Blue Eyes,Black Hair,Male Characters,Living Characters,2961.0,"1963, March",March,1963.0,3/1/1963
4,5,Marvel,Thor (Thor Odinson),No Dual Identity,Good Characters,Blue Eyes,Blond Hair,Male Characters,Living Characters,2258.0,"1950, November",November,1950.0,11/1/1950
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
23267,23268,DC,Nadine West (New Earth),Public Identity,Good Characters,NaN,NaN,Female Characters,Living Characters,NaN,NaN,1,NaN,NaN
23268,23269,DC,Warren Harding (New Earth),Public Identity,Good Characters,NaN,NaN,Male Characters,Living Characters,NaN,NaN,1,NaN,NaN
23269,23270,DC,William Harrison (New Earth),Public Identity,Good Characters,NaN,NaN,Male Characters,Living Characters,NaN,NaN,1,NaN,NaN
23270,23271,DC,William McKinley (New Earth),Public Identity,Good Characters,NaN,NaN,Male Characters,Living Characters,NaN,NaN,1,NaN,NaN
23271,23272,DC,Mookie (New Earth),Public Identity,Bad Characters,Blue Eyes,Blond Hair,Male Characters,Living Characters,NaN,NaN,1,NaN,NaN

In [183]:
comic_df = pd.read_csv('comic_characters.csv',
parse_dates=['date'], dayfirst=False, index_col='id')
comic_df

,publisher,name,Identity,align,eye,hair,sex,alive,appearances,first_appearance,month,year,date
id,,,,,,,,,,,,,
1,Marvel,Spider-Man (Peter Parker),Secret Identity,Good Characters,Hazel Eyes,Brown Hair,Male Characters,Living Characters,4043.0,"1962, August",August,1962.0,1962-08-01
2,Marvel,Captain America (Steven Rogers),Public Identity,Good Characters,Blue Eyes,White Hair,Male Characters,Living Characters,3360.0,"1941, March",March,1941.0,1941-03-01
3,Marvel,"Wolverine (James \""Logan\"" Howlett)",Public Identity,Neutral Characters,Blue Eyes,Black Hair,Male Characters,Living Characters,3061.0,"1974, October",October,1974.0,1974-10-01
4,Marvel,"Iron Man (Anthony \""Tony\"" Stark)",Public Identity,Good Characters,Blue Eyes,Black Hair,Male Characters,Living Characters,2961.0,"1963, March",March,1963.0,1963-03-01
5,Marvel,Thor (Thor Odinson),No Dual Identity,Good Characters,Blue Eyes,Blond Hair,Male Characters,Living Characters,2258.0,"1950, November",November,1950.0,1950-11-01
...,...,...,...,...,...,...,...,...,...,...,...,...,...
23268,DC,Nadine West (New Earth),Public Identity,Good Characters,NaN,NaN,Female Characters,Living Characters,NaN,NaN,1,NaN,NaT
23269,DC,Warren Harding (New Earth),Public Identity,Good Characters,NaN,NaN,Male Characters,Living Characters,NaN,NaN,1,NaN,NaT
23270,DC,William Harrison (New Earth),Public Identity,Good Characters,NaN,NaN,Male Characters,Living Characters,NaN,NaN,1,NaN,NaT
23271,DC,William McKinley (New Earth),Public Identity,Good Characters,NaN,NaN,Male Characters,Living Characters,NaN,NaN,1,NaN,NaT
23272,DC,Mookie (New Earth),Public Identity,Bad Characters,Blue Eyes,Blond Hair,Male Characters,Living Characters,NaN,NaN,1,NaN,NaT

The goal of this lab was to provide a high level introduction to pandas. There is so much more to it. You can/should practice more. A few other functions you might want to look into are: value_counts(), plot.hist(), pivot_table() and df.apply()... Note that we will use R for most of our analysis/visualization tasks but that doesn't mean you can't learn more about Python/pandas.